---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ValueOutOfRange
source: html/f5947855-2b48-332d-06dc-95f35212260d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ValueOutOfRange Property

The value must be from 0.0 to 1.0

## Syntax (C#)
```csharp
public static FailureDefinitionId ValueOutOfRange { get; }
```